{
  "backend/main.mo": "Actor implementing access‑controlled user profiles and CRUD operations for financial entries with summaries and category breakdowns.",
  "feature_evidence.json": "Feature evidence metadata listing implemented features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files and components.",
  "frontend/ANDROID_APK.md": "Guide explaining prerequisites and steps to build the Android debug APK using Capacitor and Android Studio.",
  "frontend/android/.gitignore": "Gitignore rules for Android build artifacts, IDE files, and generated folders.",
  "frontend/android/app/build.gradle": "Gradle configuration for the Android app including SDK versions, dependencies, and Capacitor integration.",
  "frontend/android/app/capacitor.build.gradle": "Auto‑generated Capacitor Gradle config setting Java 17 compatibility and plugin variables.",
  "frontend/android/app/proguard-rules.pro": "ProGuard keep rules for Capacitor, WebView JS interfaces, and app classes.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Android manifest defining app metadata, main activity, file provider, and required permissions.",
  "frontend/android/app/src/main/java/com/expensesaver/MainActivity.java": "Main Capacitor activity initializing the WebView with custom configuration.",
  "frontend/android/app/src/main/java/com/expensesaver/WebViewConfig.java": "Utility enabling JavaScript, storage, mixed content, caching, zoom, and custom user agent in WebView.",
  "frontend/android/app/src/main/res/drawable/splash.xml": "Splash screen layout displaying a white background and centered launcher icon.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Round adaptive launcher icon referencing background and foreground layers.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive launcher icon referencing background and foreground layers.",
  "frontend/android/app/src/main/res/values/colors.xml": "Theme color definitions for primary, dark primary, and accent colors.",
  "frontend/android/app/src/main/res/values/ic_launcher_background.xml": "Color resource defining the launcher icon background color.",
  "frontend/android/app/src/main/res/values/strings.xml": "App string resources including app name and package identifiers.",
  "frontend/android/app/src/main/res/values/styles.xml": "Android theme styles including main app theme and splash‑based launch theme.",
  "frontend/android/app/src/main/res/xml/file_paths.xml": "File provider paths enabling cache and external directory access.",
  "frontend/android/build.gradle": "Top-level Gradle config defining repositories, buildscript dependencies, and a clean task.",
  "frontend/android/capacitor-cordova-android-plugins/.gitignore": "Ignores the build directory for generated Cordova Capacitor plugins.",
  "frontend/android/capacitor-cordova-android-plugins/build.gradle": "Build configuration for the Capacitor Cordova Android plugins library module with SDK versions and dependencies.",
  "frontend/android/capacitor-cordova-android-plugins/cordova.variables.gradle": "Auto-generated Gradle variables file defining SDK levels and library versions for Cordova plugins.",
  "frontend/android/capacitor.settings.gradle": "Auto-generated settings file including the Capacitor Android module from node_modules.",
  "frontend/android/gradle.properties": "Project-wide Gradle settings including JVM args, AndroidX flags, and build architecture options.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Configures the Gradle wrapper to use Gradle 8.0.",
  "frontend/android/gradlew": "Unix shell script for invoking the Gradle wrapper.",
  "frontend/android/gradlew.bat": "Windows batch script for invoking the Gradle wrapper.",
  "frontend/android/settings.gradle": "Includes the app and Cordova plugin modules and applies Capacitor settings.",
  "frontend/android/variables.gradle": "Defines Android SDK versions and library version variables used across the Gradle build.",
  "frontend/capacitor.config.ts": "Capacitor config defining app metadata, web directory, and Android-specific settings.",
  "frontend/index.css": "Tailwind CSS setup with extensive theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML file loading the React app via main.tsx.",
  "frontend/scripts/android/build-debug-apk.sh": "Build script automating React build, Capacitor sync, and Android debug APK creation.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile setup, navigation, and layout rendering.",
  "frontend/src/components/auth/AuthGate.tsx": "Auth wrapper that shows a login screen until Internet Identity authentication succeeds.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth and query cache reset.",
  "frontend/src/components/dashboard/PeriodSelector.tsx": "Date-range selector with quick actions for current month and clearing filters, using popover calendars for start and end dates.",
  "frontend/src/components/entries/DeleteEntryConfirmDialog.tsx": "Confirmation dialog to delete an entry, showing entry details and triggering a delete mutation.",
  "frontend/src/components/entries/EditEntryDialog.tsx": "Dialog for editing an existing entry with fields for date, type, amount, category, and note, then submitting an update mutation.",
  "frontend/src/components/entries/EntriesEmptyState.tsx": "Displays an empty-state card encouraging the user to add their first entry.",
  "frontend/src/components/entries/EntriesMobileList.tsx": "Mobile-friendly list rendering entries with badges, amounts, notes, and edit/delete actions.",
  "frontend/src/components/entries/EntriesTable.tsx": "Main entries view with filters, date range selection, table/mobile layouts, and edit/delete dialogs.",
  "frontend/src/components/entries/EntryForm.tsx": "Form for creating new expense or saving entries with date, type, amount, category, and note inputs.",
  "frontend/src/components/layout/AppHeader.tsx": "Application header with logo, user greeting, login button, and navigation between main pages.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component with header, animated background, content wrapper, and footer including a caffeine.ai link.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting the user for their name and saving the profile via mutation with validation and toast feedback.",
  "frontend/src/constants/categories.ts": "Defines fixed expense and saving category arrays and related TypeScript types.",
  "frontend/src/hooks/queries/useDashboard.ts": "React Query hook that fetches dashboard data from the backend actor when available.",
  "frontend/src/hooks/queries/useEntries.ts": "Hooks for fetching entries and performing add/update/delete mutations while invalidating related queries.",
  "frontend/src/hooks/queries/useUserProfile.ts": "Hooks to fetch and save the caller's user profile, role, and admin status using the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, status tracking, and persisted identity handling.",
  "frontend/src/index.css": "Tailwind base styles with light/dark theme variables, background image, and animated overlay effects.",
  "frontend/src/main.tsx": "Application entry mounting React with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page computing filtered financial stats from entries and dashboard data with period selection.",
  "frontend/src/pages/DownloadApkPage.tsx": "Page showing a debug Android APK download with system requirements, installation steps, and a download button.",
  "frontend/src/pages/EntriesPage.tsx": "Page displaying a header, an entry creation form, and a table of existing entries.",
  "frontend/src/utils/currency.ts": "Provides a function to format numbers as INR currency using en-IN locale rules.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings with custom theme tokens.",
  "project_state.json": "Project state file describing app goals, design notes, known issues, and implemented features."
}