{
  "backend/main.mo": "Motoko canister managing user profiles and financial entries with access control, CRUD operations, and summary calculations.",
  "feature_evidence.json": "Feature evidence report mapping UI responsiveness and mobile improvements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend source files.",
  "frontend/index.css": "Tailwind CSS base configuration defining theme variables and global styling for light and dark modes.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading the main script.",
  "frontend/src/App.tsx": "Root React component handling login state, profile setup, navigation, and theming.",
  "frontend/src/components/auth/AuthGate.tsx": "Auth wrapper that shows a sign‑in screen when unauthenticated and renders children when logged in.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that triggers Internet Identity auth and clears cache on logout.",
  "frontend/src/components/dashboard/PeriodSelector.tsx": "Date range selector with popovers and mobile‑friendly layout for choosing report periods.",
  "frontend/src/components/entries/DeleteEntryConfirmDialog.tsx": "Dialog confirming entry deletion, showing entry details and triggering delete mutation.",
  "frontend/src/components/entries/EditEntryDialog.tsx": "Dialog for editing an existing entry, handling form state, validation, and submitting updates.",
  "frontend/src/components/entries/EntriesEmptyState.tsx": "Displays an empty-state card with illustration when no entries exist.",
  "frontend/src/components/entries/EntriesMobileList.tsx": "Renders a mobile-friendly list of entries with edit and delete actions.",
  "frontend/src/components/entries/EntriesTable.tsx": "Main entries view with filtering, date range selection, and edit/delete dialogs.",
  "frontend/src/components/entries/EntryForm.tsx": "Form for creating new expense or saving entries with validation and submission.",
  "frontend/src/components/layout/AppHeader.tsx": "App header showing logo, navigation, and user greeting with login button.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout wrapper including header, main content container, and footer.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting the user to enter and save their profile name.",
  "frontend/src/hooks/queries/useDashboard.ts": "React Query hook to fetch dashboard data from the backend actor.",
  "frontend/src/hooks/queries/useEntries.ts": "React Query hooks to fetch, add/update, and delete financial entries, with cache invalidation.",
  "frontend/src/hooks/queries/useUserProfile.ts": "React-query hooks for fetching and updating the caller’s user profile, role, and admin status via the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and state for the app.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, and responsive base styling.",
  "frontend/src/main.tsx": "App entry point that initializes React, react-query, Internet Identity provider, and global styles.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page that filters entries by date and displays summary metrics and category breakdowns.",
  "frontend/src/pages/EntriesPage.tsx": "Page showing the entry form and table for managing expenses and savings.",
  "frontend/src/utils/currency.ts": "Utility for formatting numbers as INR currency strings.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL parameters and session-persisted values.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom color palette via CSS variables, extended utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing expense-tracking app requirements, architecture notes, known issues, and implemented features with versions."
}