{
  "kind": "build_request",
  "title": "Fix inability to add new entries (authorization + error reporting)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-41",
      "text": "Fix the Add Entry flow end-to-end so a signed-in user can successfully create a new entry and see it appear in the Entries list immediately after saving.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can't able to add entries"
        ]
      },
      "acceptanceCriteria": [
        "When signed in with Internet Identity, submitting the Add New Entry form successfully creates an entry without errors.",
        "After a successful save, the new entry appears in the Entries list (and any dependent dashboard data updates) without requiring a manual refresh.",
        "The same signed-in user can add multiple entries in sequence."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Update backend access control initialization so authenticated users are reliably granted the required 'user' permissions to use core app functionality (profiles, entries, dashboard, savings goals) without needing an admin secret token.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can't able to add entries"
        ]
      },
      "acceptanceCriteria": [
        "A newly signed-in principal can call getCallerUserProfile, saveCallerUserProfile, addOrUpdateEntry, getEntries, and getDashboard without receiving an \"Unauthorized: Only users ...\" trap solely due to missing role initialization.",
        "Admin secret handling (if present) continues to work as before for admin-only privileges; non-admin users do not gain admin permissions.",
        "No state migration is required unless the implementation changes stable persisted authorization state (only add backend/migration.mo if necessary per the conditional migration policy)."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Improve frontend error handling for entry creation so failures show a clear English error message that helps the user recover (e.g., show authorization/identity/validation errors instead of only a generic failure toast).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can't able to add entries"
        ]
      },
      "acceptanceCriteria": [
        "If entry creation fails due to missing authentication/actor availability, show an English toast that indicates the user should sign in again or retry after the app finishes loading (no silent failure).",
        "If the backend returns an authorization error (trap/message), the toast surfaces a readable version of that message (or a mapped friendly message) instead of only \"Failed to add entry. Please try again.\"",
        "On success, the existing success toast remains in English and the form resets as it does today."
      ]
    }
  ],
  "constraints": [
    "Keep all Motoko logic in the single backend actor in backend/main.mo (single-actor architecture).",
    "Do not edit any files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Redesigning the Entries page UI/UX beyond what is required to make adding entries work and to improve error messages.",
    "Adding new authentication providers (only Internet Identity is supported).",
    "Introducing external databases or additional backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}