{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Android APK packaging for the existing React app (WebView wrapper)",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Add an Android wrapper project that loads the built React app in a WebView and document the exact commands to build an installable debug APK.",
      "acceptanceCriteria": [
        "Repository includes an Android wrapper project/configuration that loads the existing built web app in an Android WebView (or equivalent) and can be built into an APK.",
        "A README (or clearly named documentation file) is added with step-by-step instructions to generate a debug APK locally, including prerequisites (Android Studio/SDK, Java), install commands, and the output path/name of the generated APK.",
        "The produced debug APK can be installed on a physical Android device and successfully launches the app to the existing sign-in screen (Internet Identity flow remains functional).",
        "No backend canister changes are required to support the APK build (the APK uses the same deployed canister endpoints as the web build)."
      ],
      "file_operations": [
        {
          "path": "frontend/capacitor.config.ts",
          "operation": "create",
          "description": "Add Capacitor configuration pointing to the React build output directory (e.g., dist) and defining a stable app id/name so Capacitor can generate and manage the Android wrapper project."
        },
        {
          "path": "frontend/android/.gitignore",
          "operation": "create",
          "description": "Add Android wrapper .gitignore to avoid committing local build outputs (e.g., build/, .gradle/, local.properties) while keeping the wrapper project source tracked."
        },
        {
          "path": "frontend/android/build.gradle",
          "operation": "create",
          "description": "Create the top-level Gradle build configuration required to build the Android wrapper as a standard Android project."
        },
        {
          "path": "frontend/android/settings.gradle",
          "operation": "create",
          "description": "Create Gradle settings for the Android wrapper, including app module inclusion and any required plugin configuration for WebView/Capacitor integration."
        },
        {
          "path": "frontend/android/gradle.properties",
          "operation": "create",
          "description": "Add Gradle properties needed for consistent local builds (e.g., AndroidX settings and build performance defaults)."
        },
        {
          "path": "frontend/android/app/build.gradle",
          "operation": "create",
          "description": "Create the Android app module Gradle config for producing a debug APK, including app id, min/target SDK, signing (debug), and packaging of web assets into the APK."
        },
        {
          "path": "frontend/android/app/src/main/AndroidManifest.xml",
          "operation": "create",
          "description": "Add Android manifest configuring Internet permission, WebView usage, and the main launcher activity. Ensure WebView supports required behaviors for Internet Identity (e.g., allowing JS, handling navigation)."
        },
        {
          "path": "frontend/android/app/src/main/res/values/strings.xml",
          "operation": "create",
          "description": "Add Android app strings (English only) for app name and any required WebView wrapper labels."
        },
        {
          "path": "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml",
          "operation": "create",
          "description": "Add launcher icon resources for the APK; use existing branding as appropriate without introducing new image generation requirements."
        },
        {
          "path": "frontend/android/app/src/main/java/com/expensesaver/MainActivity.java",
          "operation": "create",
          "description": "Create the main Android activity that hosts the WebView-based wrapper and loads the packaged web assets (or the configured app URL) so the app launches to the existing sign-in screen."
        },
        {
          "path": "frontend/android/app/src/main/java/com/expensesaver/WebViewConfig.java",
          "operation": "create",
          "description": "Add a small configuration helper to ensure WebView settings required for the app and Internet Identity are enabled (JavaScript, DOM storage, cookie behavior, and safe navigation handling)."
        },
        {
          "path": "frontend/scripts/android/build-debug-apk.sh",
          "operation": "create",
          "description": "Add a convenience script that builds the React web assets and then invokes the Android Gradle task to produce a debug APK, keeping all steps deterministic for local use."
        },
        {
          "path": "frontend/ANDROID_APK.md",
          "operation": "create",
          "description": "Document step-by-step prerequisites and commands to generate and install a debug APK locally (including Android Studio/SDK + Java requirements, build commands, adb install command, and the resulting APK path such as frontend/android/app/build/outputs/apk/debug/app-debug.apk). Also explicitly note that no backend changes are required and the APK uses the same deployed canister configuration as the web build."
        }
      ]
    }
  ]
}