{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Add Entry flow (frontend wiring + better error reporting)",
  "requirements": [
    {
      "id": "REQ-41",
      "summary": "Make Add Entry succeed for authenticated users and refresh Entries/Dashboard data immediately after save.",
      "acceptanceCriteria": [
        "When signed in with Internet Identity, submitting the Add New Entry form successfully creates an entry without errors.",
        "After a successful save, the new entry appears in the Entries list (and any dependent dashboard data updates) without requiring a manual refresh.",
        "The same signed-in user can add multiple entries in sequence."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Decouple actor creation from admin-secret initialization so signed-in users can still create a usable actor even when no admin token is present; keep any admin-token behavior intact but make it best-effort (catch and surface errors non-fatally for non-admin flows). This supports the authorization component’s Internet Identity flow; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/queries/useEntries.ts",
          "operation": "modify",
          "description": "Ensure addOrUpdateEntry mutation success reliably triggers immediate refresh of entries and dashboard data (keep/increase robustness of react-query invalidation/refetch behavior) so the new entry appears without manual refresh."
        },
        {
          "path": "frontend/src/components/entries/EntryForm.tsx",
          "operation": "modify",
          "description": "On successful add, keep the current English success toast, reset the form as today, and ensure the UI remains ready for adding another entry (no stuck pending state; no dependency on manual refresh)."
        },
        {
          "path": "frontend/src/pages/EntriesPage.tsx",
          "operation": "modify",
          "description": "Wire the Add Entry UI state so that after saving an entry, the Entries list reflects the latest data in the same session (confirm the EntryForm is mounted/visible as intended when adding multiple entries and does not block list refresh)."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Improve entry-creation error handling to show actionable English messages for auth/identity/authorization/validation failures.",
      "acceptanceCriteria": [
        "If entry creation fails due to missing authentication/actor availability, show an English toast that indicates the user should sign in again or retry after the app finishes loading (no silent failure).",
        "If the backend returns an authorization error (trap/message), the toast surfaces a readable version of that message (or a mapped friendly message) instead of only \"Failed to add entry. Please try again.\"",
        "On success, the existing success toast remains in English and the form resets as it does today."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/icErrors.ts",
          "operation": "create",
          "description": "Add a small shared error-normalization helper for converting thrown errors (including authorization traps and actor/identity readiness issues) into clear English messages suitable for toasts; incorporate guidance from the authorization component’s error-handling notes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/entries/EntryForm.tsx",
          "operation": "modify",
          "description": "Replace the generic failure toast in the create-entry catch block with normalized, user-recoverable English messages (actor not available/loading vs unauthorized vs other errors) while keeping the existing English success toast unchanged."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Expose enough actor/initialization error context (without breaking existing behavior) so entry creation can distinguish between 'still loading actor' vs 'auth/authorization failure' and show appropriate English toasts per the authorization component guidance. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}